var sun=['相伴走天涯','一千零一夜','縱情藍天下','藝術是生活','派特的幸福札記','歲月如歌',
            '談情說愛','家庭學問大','觀點系列報','地球ＩＣＵ','知心人語','漫步櫻花道',
            '焦點話題','英雄出少年','梨園話絮','天地為師','法律綸語','王建煊時間',
            '藝術是生活','觀點會客室','錢線','地球ＩＣＵ','健康大數據','月滿西樓',   ];
var mon=['法律綸語','王建煊時間','梨園話絮','漫步櫻花道','天地為師','叮噹是福氣',
            '觀點會客室','讀冊過生活','歲月如歌','派特的幸福札記','阿嬤的話','愛的生活家',
            '歡迎來作客','午后音樂會','畫龍點睛','就愛Fun音樂','阿嬤的話','派特的幸福札記',
            '健康大數據','歡迎來作客','藝術是生活','王建煊時間','相伴走天涯','畫龍點睛'];   
var tue=['愛的生活家','就愛Fun音樂','阿嬤的話','畫龍點睛','歡迎來作客','健康大數據',
            '藝術是生活','王建煊時間','相伴走天涯','天地為師','阿嬤的話','愛的生活家',
            '歡迎來作客','午后音樂會','畫龍點睛','就愛Fun音樂','阿嬤的話','天地為師',
            '縱情藍天下','歡迎來作客','漫步櫻花道','知心人語','錢 線','畫龍點睛'];      
var wen=['愛的生活家','就愛Fun音樂','阿嬤的話','畫龍點睛','歡迎來作客','縱情藍天下',
            '漫步櫻花道','知心人語','錢 線','家庭學問大','阿嬤的話','愛的生活家',
            '歡迎來作客','午后音樂會','畫龍點睛','就愛Fun音樂','阿嬤的話','家庭學問大',
            '讀冊過生活','歡迎來作客','一千零一夜','觀點系列特報','談情說愛','畫龍點睛'];
var thu=['愛的生活家','就愛Fun音樂','阿嬤的話','畫龍點睛','歡迎來作客','讀冊過生活',
            '一千零一夜','觀點系列特報','談情說愛','音樂步道','阿嬤的話','愛的生活家',
            '歡迎來作客','午后音樂會','畫龍點睛','就愛Fun音樂','阿嬤的話','音樂步道',
            '月滿西樓','歡迎來作客','梨園話絮','焦點話題','英雄出少年','畫龍點睛'];
var fri=['愛的生活家','就愛Fun音樂','阿嬤的話','畫龍點睛','歡迎來作客','月滿西樓',
            '梨園話絮','焦點話題','英雄出少年','叮噹是福氣','阿嬤的話','愛的生活家',
            '歡迎來作客','午后音樂會','畫龍點睛','就愛Fun音樂','阿嬤的話','叮噹是福氣',
            '地球ICU','歡迎來作客','歲月如歌','觀點會客室','法律綸語','畫龍點睛'];
var sat=['愛的生活家','就愛Fun音樂','阿嬤的話','畫龍點睛','歡迎來作客','地球ICU',
            '歲月如歌','觀點會客室','法律綸語','月滿西樓','縱情藍天下','錢 線',
            '談情說愛','健康大數據','一千零一夜','相伴走天涯','派特的幸福札記','叮噹是福氣',
            '知心人語','家庭學問大','觀點系列特報','焦點話題','英雄出少年','讀冊過生活'];