var mon=['節目名稱A4','節目名稱B4','節目名稱C4','節目名稱D4','節目名稱E4','節目名稱A5','節目名稱B5','節目名稱C5','節目名稱D5','節目名稱A1','節目名稱A2','節目名稱A3','節目名稱A4','節目名稱A5','節目名稱A6','節目名稱A1','節目名稱A2','節目名稱A3','節目名稱A4','節目名稱A5','節目名稱A6','節目名稱A1','節目名稱A2','節目名稱A3'];
var tue=['節目名稱A4','節目名稱A5','節目名稱A6','節目名稱A1','節目名稱A2','節目名稱A3','節目名稱A4','節目名稱A5','節目名稱A5','節目名稱B1','節目名稱B2','節目名稱B3','節目名稱B4','節目名稱B5','節目名稱B6','節目名稱B1','節目名稱B2','節目名稱B3','節目名稱B4','節目名稱B5','節目名稱B6','節目名稱B1','節目名稱B2','節目名稱B3'];
var wen=['節目名稱B4','節目名稱B5','節目名稱B6','節目名稱B1','節目名稱B2','節目名稱B3','節目名稱B4','節目名稱B5','節目名稱B6','節目名稱C1','節目名稱C2','節目名稱C3','節目名稱C4','節目名稱C5','節目名稱C6','節目名稱C1','節目名稱C2','節目名稱C3','節目名稱C4','節目名稱C5','節目名稱C6','節目名稱C1','節目名稱C2','節目名稱C3'];
var thu=['節目名稱C4','節目名稱C5','節目名稱C6','節目名稱C1','節目名稱C2','節目名稱C3','節目名稱C4','節目名稱C5','節目名稱C6','節目名稱D1','節目名稱D2','節目名稱D3','節目名稱D4','節目名稱D5','節目名稱D6','節目名稱D1','節目名稱D2','節目名稱D3','節目名稱D4','節目名稱D5','節目名稱D6','節目名稱D1','節目名稱D2','節目名稱D3'];
var fri=['節目名稱D4','節目名稱D5','節目名稱D6','節目名稱D1','節目名稱D2','節目名稱D3','節目名稱D4','節目名稱D5','節目名稱D6','節目名稱E1','節目名稱E2','節目名稱E3','節目名稱E4','節目名稱E4','節目名稱E6','節目名稱E1','節目名稱E2','節目名稱E3','節目名稱E4','節目名稱E5','節目名稱E6','節目名稱E1','節目名稱E2','節目名稱E3'];
var sat=['節目名稱E4','節目名稱E5','節目名稱E6','節目名稱E1','節目名稱E2','節目名稱E3','節目名稱E4','節目名稱E5','節目名稱E6','節目名稱A1','節目名稱B1','節目名稱C1','節目名稱D1','節目名稱E1','節目名稱A2','節目名稱B2','節目名稱C2','節目名稱D2','節目名稱E2','節目名稱A3','節目名稱B3','節目名稱C3','節目名稱D3','節目名稱E3'];
var sun=['節目名稱A4','節目名稱B4','節目名稱C4','節目名稱D4','節目名稱E4','節目名稱A5','節目名稱B5','節目名稱C5','節目名稱D5','節目名稱E5','節目名稱A1','節目名稱B1','節目名稱C1','節目名稱D1','節目名稱E1','節目名稱A2','節目名稱B2','節目名稱C2','節目名稱D2','節目名稱E2','節目名稱A3','節目名稱B3','節目名稱C3','節目名稱E3'];
var k_mon=['A4.txt','B4.txt','C4.txt','D4.txt','E4.txt','A5.txt','B5.txt','C5.txt','D5.txt','A1.txt','A2.txt','A3.txt','A4.txt','A5.txt','A6.txt','A1.txt','A2.txt','A3.txt','A4.txt','A5.txt','A6.txt','A1.txt','A2.txt','A3.txt'];
var k_tue=['A4.txt','A5.txt','A6.txt','A1.txt','A2.txt','A3.txt','A4.txt','A5.txt','A5.txt','B1.txt','B2.txt','B3.txt','B4.txt','B5.txt','B6.txt','B1.txt','B2.txt','B3.txt','B4.txt','B5.txt','B6.txt','B1.txt','B2.txt','B3.txt'];
var k_wen=['B4.txt','B5.txt','B6.txt','B1.txt','B2.txt','B3.txt','B4.txt','B5.txt','B6.txt','C1.txt','C2.txt','C3.txt','C4.txt','C5.txt','C6.txt','C1.txt','C2.txt','C3.txt','C4.txt','C5.txt','C6.txt','C1.txt','C2.txt','C3.txt'];
var k_thu=['C4.txt','C5.txt','C6.txt','C1.txt','C2.txt','C3.txt','C4.txt','C5.txt','C6.txt','D1.txt','D2.txt','D3.txt','D4.txt','D5.txt','D6.txt','D1.txt','D2.txt','D3.txt','D4.txt','D5.txt','D6.txt','D1.txt','D2.txt','D3.txt'];
var k_fri=['D4.txt','D5.txt','D6.txt','D1.txt','D2.txt','D3.txt','D4.txt','D5.txt','D6.txt','E1.txt','E2.txt','E3.txt','E4.txt','E5.txt','E6.txt','E1.txt','E2.txt','E3.txt','E4.txt','E5.txt','E6.txt','E1.txt','E2.txt','E3.txt'];
var k_sat=['E4.txt','E5.txt','E6.txt','E1.txt','E2.txt','E3.txt','E4.txt','E5.txt','E6.txt','A1.txt','B1.txt','C1.txt','D1.txt','E1.txt','A2.txt','B2.txt','C2.txt','D2.txt','E2.txt','A3.txt','B3.txt','C3.txt','D3.txt','E3.txt'];
var k_sun=['A4.txt','B4.txt','C4.txt','D4.txt','E4.txt','A5.txt','B5.txt','C5.txt','D5.txt','E5.txt','A1.txt','B1.txt','C1.txt','D1.txt','E1.txt','A2.txt','B2.txt','C2.txt','D2.txt','E2.txt','A3.txt','B3.txt','C3.txt','E3.txt'];

const schedules = {
	l_mon:['A4','B4','C4','D4','E4','A5','B5','C5','D5','A1','A2','A3','A4','A5','A6','A1','A2','A3','A4','A5','A6','A1','A2','A3'],
	l_tue:['A4','A5','A6','A1','A2','A3','A4','A5','A5','B1','B2','B3','B4','B5','B6','B1','B2','B3','B4','B5','B6','B1','B2','B3'],
	l_wen:['B4','B5','B6','B1','B2','B3','B4','B5','B6','C1','C2','C3','C4','C5','C6','C1','C2','C3','C4','C5','C6','C1','C2','C3'],
	l_thu:['C4','C5','C6','C1','C2','C3','C4','C5','C6','D1','D2','D3','D4','D5','D6','D1','D2','D3','D4','D5','D6','D1','D2','D3'],
	l_fri:['D4','D5','D6','D1','D2','D3','D4','D5','D6','E1','E2','E3','E4','E5','E6','E1','E2','E3','E4','E5','E6','E1','E2','E3'],
	l_sat:['E4','E5','E6','E1','E2','E3','E4','E5','E6','A1','B1','C1','D1','E1','A2','B2','C2','D2','E2','A3','B3','C3','D3','E3'],
	l_sun:['A4','B4','C4','D4','E4','A5','B5','C5','D5','E5','A1','B1','C1','D1','E1','A2','B2','C2','D2','E2','A3','B3','C3','E3'],
};