var sun=['愛你不孤單','風箏不斷線','高年級資優班','紳士一生','我是傳奇','Guiding Stars',
         '愛的方程式','愛在他鄉','談情說愛','如有一寶','其實你不懂我的心','Darling人生',
         '醫世情緣','永保安康','星蹤有愛','相知相伴','白天不懂夜的黑','喜樂處方箋',
         '高年級資優班','讓天賦發光','躍動之星','永保安康','愛在他鄉','愛鄰福氣' ];
var mon=['喜樂處方箋','醫世情緣','Darling人生','如有一寶','家庭學問大','躍動之星',
         '愛鄰福氣','小星星協奏曲','守護一生','讓天賦發光','紳士一生','愛的生活家',
         '在祈禱中的相遇/以父之名','心靈捕手','永保安康','家庭學問大','在祈禱中的相遇/以父之名','心靈捕手',
         '星蹤步道','永保安康','我是傳奇','愛在他鄉','其實你不懂我的心','家庭學問大'];   
var tue=['愛的生活家','我是傳奇','愛在他鄉','其實你不懂我的心','在祈禱中的相遇/以父之名','心靈捕手',
         '永保安康','家庭學問大','我是傳奇','愛在他鄉','其實你不懂我的心','愛的生活家',
         '在祈禱中的相遇/以父之名','心靈捕手','紳士一生','星蹤步道','在祈禱中的相遇/以父之名','心靈捕手',
         '星蹤步道','紳士一生','醫世情緣','星蹤有愛','風箏不斷線','星蹤步道'];      
var wen=['愛的生活家','醫世情緣','星蹤有愛','風箏不斷線','在祈禱中的相遇/以父之名','心靈捕手',
         '紳士一生','星蹤步道','醫世情緣','星蹤有愛','風箏不斷線','愛的生活家',
         '在祈禱中的相遇/以父之名','心靈捕手','如有一寶','愛的方程式','在祈禱中的相遇/以父之名','心靈捕手',
         '星蹤步道','如有一寶','守護一生','躍動之星','Guiding Stars','愛的方程式'];
var thu=['愛的生活家','守護一生','躍動之星','Guiding Stars','在祈禱中的相遇/以父之名','心靈捕手',
         '如有一寶','愛的方程式','守護一生','躍動之星','Guiding Stars','愛的生活家',
         '在祈禱中的相遇/以父之名','心靈捕手','高年級資優班','愛你不孤單','在祈禱中的相遇/以父之名','心靈捕手',
         '星蹤步道','高年級資優班','愛鄰福氣','白天不懂夜的黑','讓天賦發光','愛你不孤單'];
var fri=['愛的生活家','愛鄰福氣','白天不懂夜的黑','讓天賦發光','在祈禱中的相遇/以父之名','心靈捕手',
         '高年級資優班','愛你不孤單','愛鄰福氣','白天不懂夜的黑','讓天賦發光','愛的生活家',
         '在祈禱中的相遇/以父之名','心靈捕手','Darling人生','談情說愛','在祈禱中的相遇/以父之名','心靈捕手',
         '星蹤步道','Darling人生','喜樂處方箋','相知相伴','小星星協奏曲','談情說愛'];
var sat=['愛的生活家','喜樂處方箋','相知相伴','小星星協奏曲','在祈禱中的相遇/以父之名','心靈捕手',
         'Darling人生','談情說愛','喜樂處方箋','相知相伴','小星星協奏曲','家庭學問大',
         '我是傳奇','Guiding Stars','愛你不孤單','守護一生','其實你不懂我的心','愛的方程式',
         '風箏不斷線','小星星協奏曲','星蹤有愛','相知相伴','談情說愛','白天不懂夜的黑'];