var sun=['永保安康','喜樂處方箋','心靈美樂地','換我來顧','知心人語','心靈美樂地',
         '心靈美樂地','露天咖啡座','焦點話題', '愛鄰福氣','Darling人生','心靈美樂地',
         '歲月如歌','縱情藍天下','紳士一生','我是傳奇','蔬果家庭','如有一寶',
         '換我來顧','心靈美樂地','有愛就是家','心靈美樂地','觀點會客室','倒數時刻'];
var mon=['小星星協奏曲','Darling人生','紳士一生','心靈美樂地','歲月如歌','請問醫師',
         '蔬果家庭','我是傳奇','一杯好咖啡 & 心靈美樂地','觀點會客室','永保安康','喜樂處方箋',
         '心靈美樂地','心靈美樂地','Darling人生','心靈美樂地','一杯好咖啡 & 心靈美樂地','心靈美樂地',
         '觀點會客室','永保安康','喜樂處方箋','心靈美樂地','Darling人生','心靈美樂地'];   
var tue=['一杯好咖啡 & 心靈美樂地','心靈美樂地','觀點會客室','永保安康','喜樂處方箋','心靈美樂地',
         'Darling人生','心靈美樂地','一杯好咖啡 & 心靈美樂地','我是傳奇','露天咖啡座','如有一寶',
         '心靈美樂地','心靈美樂地','歲月如歌','心靈美樂地','一杯好咖啡 & 心靈美樂地','心靈美樂地',
         '我是傳奇','露天咖啡座','如有一寶','心靈美樂地','歲月如歌','心靈美樂地'];      
var wen=['一杯好咖啡 & 心靈美樂地','心靈美樂地','我是傳奇','露天咖啡座','如有一寶','心靈美樂地',
         '歲月如歌','心靈美樂地','一杯好咖啡 & 心靈美樂地','倒數時刻','請問醫師','愛鄰福氣',
         '心靈美樂地','心靈美樂地','知心人語','心靈美樂地','一杯好咖啡 & 心靈美樂地','心靈美樂地',
         '倒數時刻','請問醫師','愛鄰福氣','心靈美樂地','知心人語','心靈美樂地'];
var thu=['一杯好咖啡 & 心靈美樂地','心靈美樂地','倒數時刻','請問醫師','愛鄰福氣','心靈美樂地',
         '知心人語','心靈美樂地','一杯好咖啡 & 心靈美樂地','縱情藍天下','蔬果家庭','紳士一生',
         '心靈美樂地','心靈美樂地','有愛就是家','心靈美樂地','一杯好咖啡 & 心靈美樂地','心靈美樂地',
         '縱情藍天下','蔬果家庭','紳士一生','心靈美樂地','有愛就是家','心靈美樂地'];
var fri=['一杯好咖啡 & 心靈美樂地','心靈美樂地','縱情藍天下','蔬果家庭','紳士一生','心靈美樂地',
         '有愛就是家','心靈美樂地','一杯好咖啡 & 心靈美樂地','心靈美樂地','焦點話題','小星星協奏曲',
         '心靈美樂地','心靈美樂地','換我來顧','心靈美樂地','一杯好咖啡 & 心靈美樂地','心靈美樂地',
         '心靈美樂地','焦點話題','小星星協奏曲','心靈美樂地','換我來顧','心靈美樂地'];
var sat=['一杯好咖啡 & 心靈美樂地','心靈美樂地','心靈美樂地','焦點話題','小星星協奏曲','心靈美樂地',
         '換我來顧','心靈美樂地','觀點會客室','有愛就是家','如有一寶','永保安康',
         '心靈美樂地','露天咖啡座','倒數時刻','小星星協奏曲','喜樂處方箋','愛鄰福氣',
         '知心人語','心靈美樂地','心靈美樂地','焦點話題','縱情藍天下','請問醫師'];